class SquareDef():
    def area(a):
        '''Принимает число a - сторона квадрата, возвращает его произведение самого на себя - площадь квадрата

            Пример работы функции:
            >> area(7)
            >> 49
        '''
        return a * a


    def perimeter(a):
        '''Принимает число a(сторона квадрата), возвращает произведение 4 * a (периметр квадрата)
        
            Пример работы функции:
            >> perimeter(5)
            >> 20
        '''
        return 4 * a
